package com.caizhiguo.demo01;

/**
 * @Program: JavaBaseWorkSpace
 * @ClassName: BasicDemo01
 * @Description: java的注释
 * @Author: 蔡至国
 * @DateTime: 2022年09月11日 10时02分
 * @Version 1.0
 */
//注释:在程序中用于解释说明的文字
//
//分类:
//   单行注释
//        注释当前行内容
//   多行注释
//        注释多行内容
//   文档注释(暂不涉及)
//        注释多行内容,并附上代码的版本,作者,时间等等
//
//格式:
//    单行注释
//        //注释内容
//    多行注释
//		/*
//			注释内容
//		*/
//    文档注释:
//        /**
//         注释内容
//         */
//
//注意事项:
//    1.多行注释以/*作为注释的开始,以遇到的第一个*/作为注释的结束
//    2.文档注释以/**作为注释的开始,以遇到的第一个*/作为注释的结束
public class BasicDemo01 {
}
