package com.caizhiguo.demo06;

/**
 * @Program: JavaBaseWorkSpace
 * @ClassName: BasicDemo06
 * @Description: 表示符的定义规则
 * @Author: 蔡至国
 * @DateTime: 2022年09月11日 10时35分
 * @Version 1.0
 */
/*
	标识符:
		在程序中给变量,方法,类,接口,包等起的名字

	标识符的特点:
		硬性规则(必须遵守,如不遵守编译报错)
		软性规范(程序员间约定俗成)

	硬性规则内容:
		1.标识符可以由26个大小写英文,0-9数字,美元符$,下划线_,中文组成
		2.0-9数字不能作为标识符的开始
		3.不能是程序中的53个关键字

	软性规范:
		1.标识符不推荐使用中文;
		2.标识符命名的时候需要做到"见名知意"
		3.给不同的标识符命名的时候需要遵循不同的规范
			类的命名规范:
				一个单词:单词的首字母大写
				多个单词:每个单词的首字母大写
			方法的命名规范:
				一个单词:单词全部小写
				多个单词:第一个单词全部小写,第二个单词开始每个单词的首字母大写
			变量的命名规则:
				一个单词:单词全部小写
				多个单词:第一个单词全部小写,第二个单词开始每个单词的首字母大写
*/
public class BasicDemo06 {
}
